---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCAnyHandle.HasValue
source: html/0059a98c-ceba-3656-56d5-46ff8a95c6a0.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.HasValue Property

Identifies if the handle is empty or contains a value.

## Syntax (C#)
```csharp
public bool HasValue { get; }
```